Repository: PaulSburlea/Krono
Catalog: lib/l10n/app_*.arb
Languages: fr

# madeWith
source: Made with ❤️ using Flutter.
fr: Fait avec ❤️ avec Flutter.

# copyright
source: © 2026 Krono Team. All rights reserved.
fr: © 2026 Équipe Krono. Tous droits réservés.

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

source: Retry
fr: Réessayer

source: Retake
fr: Reprendre

source: Processing…
fr: Traitement en cours…

source: Unlock
fr: Déverrouiller

source: year
fr: an

source: years
fr: ans

# weekShort
source: wk.
fr: sem.

source: day
fr: jour

source: days
fr: jours

source: Your Memories
fr: Vos Souvenirs

# quoteTitle
source: Quote of the Day
fr: Citation du jour

# streakSuffix
source: Day Streak!
fr: Jours de série !

# streakLongMessage
source: You're phenomenal! You've saved memories for {count} days.
fr: Vous êtes phénoménal ! Vous avez enregistré des souvenirs pendant {count} jours.

# startFirstDay
source: Start your first day!
fr: Commencez votre première journée !

# emptyJournalTitle
source: Your journal is empty
fr: Votre journal est vide

# emptyJournalMessage
source: Start by adding your first memory! ✨
fr: Commencez par ajouter votre premier souvenir ! ✨

# createMemory
source: Create a memory
fr: Créer un souvenir

# startFirstMemory
source: Start by adding your first memory! ✨
fr: Commencez par ajouter votre premier souvenir ! ✨

# visualJournal
source: Your Visual Journal
fr: Votre journal visuel

# addMemory
source: Add Today's Memory
fr: Ajouter un souvenir

# editEntry
source: Edit memory
fr: Modifier le souvenir

source: Save Day
fr: Enregistrer la journée

# writeMemory
source: Write a memory...
fr: Écrire un souvenir...

# noteHint
source: What interesting happened?
fr: Qu'est-ce qui s'est passé d'intéressant ?

# noNote
source: No note for this day.
fr: Pas de note pour ce jour.

# noPhotos
source: No photos yet.
fr: Pas encore de photos.

# futureDateError
source: You can't add memories for the future! 😊
fr: Vous ne pouvez pas ajouter de souvenirs pour le futur ! 😊

source: Camera
fr: Appareil photo

source: Gallery
fr: Galerie

# takePhoto
source: Take a photo
fr: Prendre une photo

# pickGallery
source: Pick from gallery
fr: Choisir dans la galerie

# moodTitle
source: How was today?
fr: Comment s'est passée la journée ?

# myMood
source: Your mood
fr: Votre humeur

source: Your mood
fr: Votre humeur

# moodLabel
source: Daily Mood
fr: Humeur quotidienne

source: Location
fr: Lieu

source: Add location
fr: Ajouter le lieu

source: Weather
fr: Météo

source: Add weather
fr: Ajouter la météo

# memoriesFrom
source: Memories from {date}
fr: Souvenirs du {date}

# memoryPopup
source: {emoji} Memory
fr: {emoji} Souvenir

# memoriesCount
source: {count, plural, =1{1 memory} other{{count} memories}}
fr: {count, plural, =1{1 souvenir} other{{count} souvenirs}}

# deleteEntryTitle
source: Delete this memory?
fr: Supprimer ce souvenir ?

# deleteEntryDesc
source: This action is permanent and will also delete the photo.
fr: Cette action est définitive et supprimera également la photo.

source: Settings
fr: Paramètres

source: Personalization
fr: Personnalisation

# info
source: Information
fr: Informations

source: About Krono
fr: À propos de Krono

# aboutKronoDetail
source: Krono is your personal space for thoughts and memories. Designed with privacy and simplicity in mind, it helps you capture life's moments one day at a time. Thank you for choosing us to be part of your journey!
fr: Krono est votre espace personnel pour vos pensées et souvenirs. Conçu dans un esprit de confidentialité et de simplicité, il vous aide à capturer les moments de la vie jour après jour. Merci de nous avoir choisis pour faire partie de votre voyage !

# aboutDescription
source: Krono is your daily visual journal. Designed to be simple, private, and fast.
fr: Krono est votre journal visuel quotidien. Conçu pour être simple, privé et rapide.

source: App Theme
fr: Thème de l'app

source: Choose Theme
fr: Choisir le thème

# chooseAccent
source: Choose accent color
fr: Choisir la couleur d'accentuation

source: Dark Mode
fr: Mode sombre

# themeEmerald
source: Emerald
fr: Émeraude

# themeOcean
source: Ocean
fr: Océan

# themeSunset
source: Sunset
fr: Coucher de soleil

# themeBerry
source: Berry
fr: Baie

# themeMidnight
source: Midnight
fr: Minuit

source: Language
fr: Langue

source: Choose Language
fr: Choisir la langue

source: Daily Reminder
fr: Rappel Quotidien

# reminderSubtitle
source: Get a notification so you don't forget to save your memory.
fr: Recevez une notification pour ne pas oublier de sauvegarder votre souvenir.

# reminderNotificationTitle
source: Time for Krono 📸
fr: L'heure de Krono 📸

# reminderNotificationBody
source: How was your day? Don't forget to add a photo and some thoughts!
fr: Comment s'est passée votre journée ? N'oubliez pas d'ajouter une photo et quelques pensées !

# notificationTitle
source: Pause. Capture. Krono. ✨
fr: Clic ! C'est l'heure 📸

# notificationBody
source: One photo today, a thousand memories tomorrow.
fr: Ne laissez pas ce moment s'envoler. Ajoutez votre photo du jour !

# notificationsDenied
source: Notification permission denied
fr: Permission de notification refusée

# notificationsDeniedTitle
source: Notifications Disabled
fr: Notifications désactivées

# notificationsDeniedContent
source: Notifications are disabled. Please enable them from the phone settings to receive daily reminders.
fr: Les notifications sont désactivées. Veuillez les activer dans les paramètres du téléphone pour recevoir des rappels quotidiens.

source: Open Settings
fr: Paramètres

source: App Lock
fr: Verrouillage

# biometrics
source: Biometrics (FaceID / Fingerprint)
fr: Biométrie (FaceID / Empreinte)

# authReason
source: Confirm identity to open the journal
fr: Confirmez votre identité pour ouvrir le journal

# authReasonToggleOn
source: Confirm identity to enable app lock
fr: Confirmez l'identité pour activer le verrouillage

# authReasonToggleOff
source: Confirm identity to disable app lock
fr: Confirmez l'identité pour désactiver le verrouillage

# authFailed
source: Authentication failed
fr: Authentification échouée

source: Access Restricted
fr: Accès restreint

# confirmIdentity
source: Please confirm your identity to continue.
fr: Veuillez confirmer votre identité pour continuer.

source: Data & Backup
fr: Données et Sauvegarde

source: My Krono Backup
fr: Ma sauvegarde Krono

# exportBackup
source: Export Full Backup
fr: Exporter une sauvegarde complète

# exportZipSubtitle
source: Create a ZIP file with photos and data
fr: Créer un fichier ZIP avec photos et données

# exportingTitle
source: Preparing Backup...
fr: Préparation de la sauvegarde...

# exportingMessage
source: Please wait while we compress your memories. This may take a minute.
fr: Veuillez patienter pendant que nous compressons vos souvenirs. Cela peut prendre une minute.

# backupShareSubject
source: Krono Backup
fr: Sauvegarde Krono

# backupShareText
source: Here is my Krono journal backup file.
fr: Voici le fichier de sauvegarde de mon journal Krono.

source: Import Backup
fr: Importer une sauvegarde

# importZipSubtitle
source: Restore everything from a ZIP file
fr: Tout restaurer à partir d'un fichier ZIP

# importingTitle
source: Restoring...
fr: Restauration...

# importingMessage
source: We are bringing your memories back.
fr: Nous récupérons vos souvenirs.

# exportPdf
source: Export as PDF
fr: Exporter en PDF

# exportPdfSubtitle
source: Create a book of your memories
fr: Créer un livre de vos souvenirs

source: Generating PDF...
fr: Génération du PDF...

# noEntriesToExport
source: No entries found to export.
fr: Aucune entrée à exporter.

# securityNotSetup
source: Security not set up. Please enable a PIN or biometrics in your device settings.
fr: Sécurité non configurée. Veuillez activer un code PIN ou la biométrie dans les paramètres de votre appareil.

source: Danger Zone
fr: Zone de danger

# deleteAll
source: Delete All Data
fr: Supprimer toutes les données

source: Delete All Data
fr: Supprimer toutes les données

# irreversible
source: Irreversible action
fr: Action irréversible

# confirmDeleteTitle
source: Delete all data?
fr: Supprimer toutes les données ?

# confirmDeleteContent
source: Are you sure you want to delete all data? This action is permanent.
fr: Êtes-vous sûr de vouloir supprimer toutes les données ? Cette action est permanente.

# deleteConfirmTitle
source: Delete all data?
fr: Supprimer toutes les données ?

# deleteConfirmDesc
source: This action will permanently delete all memories from the journal. You cannot undo this operation.
fr: Cette action supprimera définitivement tous les souvenirs du journal. Vous ne pouvez pas annuler cette opération.

# saveGallerySuccess
source: Image saved to gallery! ✨
fr: Image enregistrée dans la galerie ! ✨

# entryDeleted
source: Memory deleted
fr: Souvenir supprimé

# backupSuccess
source: Backup generated successfully!
fr: Sauvegarde générée avec succès !

# backupExportedSuccess
source: Backup exported successfully!
fr: Sauvegarde exportée avec succès !

# backupRestored
source: Backup restored successfully!
fr: Sauvegarde restaurée avec succès !

# importSuccess
source: Data imported successfully!
fr: Données importées avec succès !

# deleteSuccess
source: All data has been deleted.
fr: Toutes les données ont été supprimées.

# deleteAllSuccess
source: All data has been successfully deleted
fr: Toutes les données ont été supprimées avec succès

# loadingError
source: Error loading data.
fr: Erreur lors du chargement.

# imageLoadError
source: Error loading image
fr: Erreur de chargement de l'image

# backupExportError
source: Failed to create backup. Please try again.
fr: Échec de la création de la sauvegarde. Veuillez réessayer.

# backupErrorEmpty
source: Backup failed: Generated file is empty.
fr: Échec de la sauvegarde : le fichier généré est vide.

# errorExport
source: Export error: {e}
fr: Erreur d'exportation : {e}

# errorImport
source: Import error: {e}
fr: Erreur d'importation : {e}

# noInternetError
source: Internet connection required for weather and location.
fr: Connexion Internet requise pour la météo et la localisation.

# locationDisabled
source: Location services are disabled on this device.
fr: Les services de localisation sont désactivés sur cet appareil.

# locationPermissionDenied
source: Location permission was denied.
fr: L'autorisation de localisation a été refusée.

# errorFetchingMetadata
source: Could not fetch weather and location data.
fr: Impossible de récupérer les données météo et de localisation.

# enableLocationMessage
source: Please enable location access in settings to fetch weather and city name.
fr: Veuillez activer l'accès à la localisation dans les paramètres pour récupérer la météo et la ville.

source: Privacy Policy
fr: Politique de Confidentialité

source: Send Feedback
fr: Envoyer un avis

# feedbackSubject
source: Krono Feedback
fr: Avis Krono

source: Device Info
fr: Infos Appareil
